# Pandas

In [1]:
import pandas
pandas.__version__

'1.0.5'

In [2]:
import numpy as np
import pandas as pd

### Series

In [3]:
# Series is a single vector of data with an index that lables each statementin the vector.

count = pd.Series([100,200,300,400,500])
count

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [4]:
count.values

array([100, 200, 300, 400, 500], dtype=int64)

In [5]:
count.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
bacteria = pd.Series([100,200,300,400],
   index=['A','B','C','D'])

bacteria

A    100
B    200
C    300
D    400
dtype: int64

In [7]:
bacteria['D']

400

In [8]:
bacteria[2]

300

In [9]:
bacteria.name ='Counts'
bacteria.index.name='Phylum'
bacteria

Phylum
A    100
B    200
C    300
D    400
Name: Counts, dtype: int64

In [10]:
np.log(bacteria)

Phylum
A    4.605170
B    5.298317
C    5.703782
D    5.991465
Name: Counts, dtype: float64

In [11]:
bacteria[bacteria>300]

Phylum
D    400
Name: Counts, dtype: int64

In [12]:
#dictionary 

bac_dict ={'A':150,'B':250,'C':350}
print(bac_dict)
pd.Series(bac_dict)

{'A': 150, 'B': 250, 'C': 350}

A    150
B    250
C    350
dtype: int64

### Data Frame : bi dimensional Series with two or more indices

In [13]:
data = {'NAMES':['Rachna','Prerana','Spandana','Sanchana'],
        "YOB":[1998,2006,1991,1995],
        "Studying":['Btech','School','MS ENT','LAW']}
print (data)
data=pd.DataFrame(data)
data

{'NAMES': ['Rachna', 'Prerana', 'Spandana', 'Sanchana'], 'YOB': [1998, 2006, 1991, 1995], 'Studying': ['Btech', 'School', 'MS ENT', 'LAW']}

      NAMES   YOB Studying
0    Rachna  1998    Btech
1   Prerana  2006   School
2  Spandana  1991   MS ENT
3  Sanchana  1995      LAW

In [14]:
dafr=pd.DataFrame(data, columns=['NAMES','Studying','YOB'])
dafr

      NAMES Studying   YOB
0    Rachna    Btech  1998
1   Prerana   School  2006
2  Spandana   MS ENT  1991
3  Sanchana      LAW  1995

In [15]:
dafr['fav']=['eating','eating','eating','eating']
dafr

      NAMES Studying   YOB     fav
0    Rachna    Btech  1998  eating
1   Prerana   School  2006  eating
2  Spandana   MS ENT  1991  eating
3  Sanchana      LAW  1995  eating

In [16]:
dafr['new']=pd.Series(range(0,20,5),index=[0,1,2,3])
dafr

      NAMES Studying   YOB     fav  new
0    Rachna    Btech  1998  eating    0
1   Prerana   School  2006  eating    5
2  Spandana   MS ENT  1991  eating   10
3  Sanchana      LAW  1995  eating   15

In [17]:
dafr.to_dict()

{'NAMES': {0: 'Rachna', 1: 'Prerana', 2: 'Spandana', 3: 'Sanchana'},
 'Studying': {0: 'Btech', 1: 'School', 2: 'MS ENT', 3: 'LAW'},
 'YOB': {0: 1998, 1: 2006, 2: 1991, 3: 1995},
 'fav': {0: 'eating', 1: 'eating', 2: 'eating', 3: 'eating'},
 'new': {0: 0, 1: 5, 2: 10, 3: 15}}

In [18]:
pd.DataFrame(dafr.to_dict())

      NAMES Studying   YOB     fav  new
0    Rachna    Btech  1998  eating    0
1   Prerana   School  2006  eating    5
2  Spandana   MS ENT  1991  eating   10
3  Sanchana      LAW  1995  eating   15

In [19]:
#list to dataframe
l=[{'a':i,'b':i*i}for i in range(6)]
print(l)

pd.DataFrame(l)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 1}, {'a': 2, 'b': 4}, {'a': 3, 'b': 9}, {'a': 4, 'b': 16}, {'a': 5, 'b': 25}]

   a   b
0  0   0
1  1   1
2  2   4
3  3   9
4  4  16
5  5  25

In [20]:
#NaN
df=pd.DataFrame([{'a':(1,2),'b':3},{'b':5,'c':7}])
df

        a  b    c
0  (1, 2)  3  NaN
1     NaN  5  7.0

In [21]:
#tree={'Park':[12,15,20],'Jungle':[199,234,76]}

tree=pd.DataFrame({'Park':[12,20,1],'Jungle':[199,234,76]},
                  index=['Tree a','Tree b','Tree c'])
a=tree.to_dict()
print(a)
pd.DataFrame(a)

{'Park': {'Tree a': 12, 'Tree b': 20, 'Tree c': 1}, 'Jungle': {'Tree a': 199, 'Tree b': 234, 'Tree c': 76}}

        Park  Jungle
Tree a    12     199
Tree b    20     234
Tree c     1      76

In [22]:
ntrandom=pd.DataFrame(np.random.randint(50,100),
                     columns=['PARK','FOREST'],
                     index=['Tree a','Tree b'])
    
ntrandom

        PARK  FOREST
Tree a    70      70
Tree b    70      70

### Index Object

In [23]:
ind=pd.Index([1,23,345,456,678,23,34,56,46])
ind

Int64Index([1, 23, 345, 456, 678, 23, 34, 56, 46], dtype='int64')

In [24]:
ind[3]

456

In [25]:
ind[0:5:3]

Int64Index([1, 456], dtype='int64')

In [26]:
print(ind.size,
      ind.shape,
      ind.ndim,
      ind.dtype)

9 (9,) 1 int64

### Operating on Data in Pandas

In [27]:
rng=np.random.RandomState(10)
ser=pd.Series(rng.randint(0,10,5))
ser

0    9
1    4
2    0
3    1
4    9
dtype: int32

In [28]:
dfr=pd.DataFrame(rng.randint(0,10,(5,4)),
                 columns=['A','B','C','D'])
dfr

   A  B  C  D
0  0  1  8  9
1  0  8  6  4
2  3  0  4  6
3  8  1  8  4
4  1  3  6  5

In [29]:
np.exp(ser)

0    8103.083928
1      54.598150
2       1.000000
3       2.718282
4    8103.083928
dtype: float64

In [30]:
np.sin(dfr+np.pi/4)

          A         B         C         D
0  0.707107  0.977061  0.596698 -0.352855
1  0.707107  0.596698  0.481366 -0.997336
2 -0.600243  0.707107 -0.997336  0.481366
3  0.596698  0.977061  0.596698 -0.997336
4  0.977061 -0.600243  0.481366 -0.477482

### Index Alignment

In [31]:
area = pd.Series({'A': 1723337, 'T': 695662,
                  'C': 423967}, name='area')
population = pd.Series({'C': 39932521, 'T': 44810093,
                        'N': 5000127}, name='population')
print(area)
population

A    1723337
T     695662
C     423967
Name: area, dtype: int64

C    39932521
T    44810093
N     5000127
Name: population, dtype: int64

In [32]:
population/area

A          NaN
C    94.187805
N          NaN
T    64.413599
dtype: float64

In [33]:
area.index|population.index

Index(['A', 'C', 'N', 'T'], dtype='object')

In [34]:
AB= pd.Series([18,20,39],index=[0,1,2])
BC=pd.Series([20,34,45],index=[1,2,3])
print(AB)
print(BC)

AB+BC

0    18
1    20
2    39
dtype: int64
1    20
2    34
3    45
dtype: int64

0     NaN
1    40.0
2    73.0
3     NaN
dtype: float64

In [35]:
AB.add(BC,fill_value=0)

0    18.0
1    40.0
2    73.0
3    45.0
dtype: float64

### Data Wrangling

In [36]:
dafr

      NAMES Studying   YOB     fav  new
0    Rachna    Btech  1998  eating    0
1   Prerana   School  2006  eating    5
2  Spandana   MS ENT  1991  eating   10
3  Sanchana      LAW  1995  eating   15

In [37]:
df2=pd.DataFrame({"NAMES":["Rachna","Prerana"],'Height':[5.9,5.4]})
df2

     NAMES  Height
0   Rachna     5.9
1  Prerana     5.4

In [38]:
dafr.merge(df2)

     NAMES Studying   YOB     fav  new  Height
0   Rachna    Btech  1998  eating    0     5.9
1  Prerana   School  2006  eating    5     5.4

In [60]:
dfa3=pd.DataFrame({"NAMES":["Rachna","Prerana"],'Height':[5.9,5.4]})
dafr.merge(dfa3, right_on="NAMES", left_on='NAMES',how='outer')

      NAMES Studying   YOB     fav  new  Height
0    Rachna    Btech  1998  eating    0     5.9
1   Prerana   School  2006  eating    5     5.4
2  Spandana   MS ENT  1991  eating   10     NaN
3  Sanchana      LAW  1995  eating   15     NaN

In [59]:
df4 = pd.DataFrame({"NAMES": ["Rachna", "Prerana", "Sanchanaa"], "fav": ["eating", "eating", "eating"]})
dafr.merge(df4, how='outer')

       NAMES Studying     YOB     fav   new
0     Rachna    Btech  1998.0  eating   0.0
1    Prerana   School  2006.0  eating   5.0
2   Spandana   MS ENT  1991.0  eating  10.0
3   Sanchana      LAW  1995.0  eating  15.0
4  Sanchanaa      NaN     NaN  eating   NaN

### Combining data with overlap

In [62]:
a = pd.Series([np.nan, 25, np.nan, 35, 45, np.nan,60],
                     index=['f', 'e', 'd', 'c', 'b', 'a','r'])
b = pd.Series(np.arange(len(a), dtype=np.int64),
                 index=['f', 'e', 'd', 'c', 'b', 'a','r'])

In [63]:
a.combine_first(b)

f     0.0
e    25.0
d     2.0
c    35.0
b    45.0
a     5.0
r    60.0
dtype: float64

In [66]:
pd.Series(np.where(pd.isnull(a),b,a),index=a.index)

f     0.0
e    25.0
d     2.0
c    35.0
b    45.0
a     5.0
r    60.0
dtype: float64